<html><head><title>NAV: Databasedesign dokumentasjon</title></head><body><h1>NAVuser systemdokumentasjon</h1><p>Dokumentasjonen er ment for systemutviklere i NAV. Men kan ogs&aring; leses   av NAV-adminstratorer.<p><strong>Innholdsfortegnelse</strong>: <ul>  <li><a href="#revisjoner">Revisjoner</a></li>  <li><a href="#hvaer">Hva er NAVuser</a></li>  <li><a href="#filer">Filer som tilh&oslash;rer NAVuser</a></li>  <li><a href="#database">Databasedesign </a>     <ul>      <li><a href="#brukere">Brukere og brukergrupper</a></li>      <li><a href="#utstyr">Utstyrgrupper</a></li>      <li><a href="#profiler">Brukerprofiler</a></li>    </ul>  </li>  <li><a href="#kontakt">Kontaktperson</a></li></ul><p><strong>Eksterne dokumenter</strong> som h&oslash;rer til dokumentasjonen:</p><ul>  <li><a href="databasemodell.pdf">UML-diagram</a> for databasemodellen</li></ul><h2><a name="revisjoner"></a>Revisjoner</h2><ul>  <li>Revidert 14. Januar 2003. Skrevet dokumentasjonen mer utfyllende. Endret     det som allerede var skrevet slik at det var oppdatert i forhold til siste     versjon av NAVuser. [Andreas]</li>  <li>Revidert 19. Juli 2002. [Andreas]</li>  <li>Skrevet f&oslash;rste gang 4. Juni 2002, av Andreas &Aring;kre Solberg.</li></ul><h2><a name="hvaer"></a>Hva er NAVuser</h2><p>NAVuser er en del av NAV fra og med versjon 3. NAVuser er et delsystem som   h&aring;ndterer brukerdatabasen og et system for varslingsprofiler for brukere.   NAVuser bruker en postgresql database med navn <font face="Courier New, Courier, mono">navuser</font>.   Grensesnittet for &aring; administrere brukerdatabasen og varslingsprofilene   er webbasert og skrevet i php. Hver bruker kan logge inn med sitt brukernavn   og passord, og definere sine egne profiler for varsling, og spesifisere grupper   av utstyr man &oslash;nsker varsling p&aring;, til hvilke tider man &oslash;nsker   varsling og p&aring; hvilket medium man &oslash;nsker &aring; bli varslet (eks:   mail og sms).</p><h2><a name="filer"></a>Filer som tilh&oslash;rer NAVuser</h2><p>Filene som inng&aring;r i delsystemet NAVuser er delt inn i: www-filer, dokumentasjon   og databaseinitialiseringsskript.</p><p>Dokumentasjonen er plassert under <font face="Courier New, Courier, mono">navme/doc/navuser/</font>.</p><p>Databaseinitialiseringsskriptet er plassert her: <font face="Courier New, Courier, mono">navme/etc/conf/db/navuser.sql</font>.</p><h3>www-filer</h3><p>Her f&oslash;lger en beskrivelse av alle php-filene som inng&aring;r i www-delen   av NAVuser. Siden administreringen er webbasert er dette hoveddelen av NAVuser.</p><h4>Underkataloger</h4><p><font face="Courier New, Courier, mono">drwxrwxrwx 6 andrs staff 204 Jan 10   18:38 css<br>  drwxrwxrwx 33 andrs staff 1122 Jan 10 18:41 icons<br>  drwxrwxrwx 8 andrs staff 272 Jan 10 18:46 images</font></p><p><font face="Courier New, Courier, mono"><strong>css</strong></font> inneholder   stylesheetsfiler, som definerer utseende p&aring; sidene. <font face="Courier New, Courier, mono"><strong>icons</strong></font>   er en katalog med alle ikonene. <strong><font face="Courier New, Courier, mono">images</font></strong>   inneholder andre bilder, som topplogo med mer.</p><h4>Hovedfilen index.php</h4><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 5803 Jan 9   11:46 index.php</font></p><p>Alle undersidene i webgrensesnittet aksesseres via hovedfilen <font face="Courier New, Courier, mono">index.php</font>.   Det er en sesjonsvariabel $action i php som holder styr p&aring; hvilke seksjon   man jobber med, alts&aring; hvilke av php-filene som lastes inn i hovedvinduet   i webgrensesnittet. Disse seksjonene kan deles inn i flere sekvenser, som spesifiseres   med variabelen <font face="Courier New, Courier, mono">$subaction</font>. Siden   disse variablene blir lagret i sesjonen p&aring; serversiden, husker serveren   hvilke seksjon man jobber p&aring; slik at man bare oppgir <font face="Courier New, Courier, mono">$action</font>   parametre n&aring;r man &oslash;nsker &aring; endre seksjon. Dette ser man typisk   p&aring; lenkene i menyen i venstremargen som typisk kan v&aelig;re <font face="Courier New, Courier, mono">index.php?action=admin</font>. </p><h4>PHP-filer</h4><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 7687 Jan 9   16:04 admin.php<br>  -rw-r--r-- 1 andrs staff 4618 Oct 30 10:00 adress.php</font></p><p>Filen <font face="Courier New, Courier, mono">admin.php</font> har med administreringen   av brukere &aring; gj&oslash;re. </p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 3213 Jan 9   07:56 auth.php</font></p><p>Kalles ifra <font face="Courier New, Courier, mono">index.php</font> hver gang   og sjekker sesjonsvariabelen om brukeren er korrekt innlogget, og itillefelle   hvilke admin-niv&aring; brukeren har. I databasetabellen Bruker er et heltall   kalt admin som kan v&aelig;re mellom 0 og 100. 0 er avsl&aring;tt brukerkonto.   1 er vanlig bruker. 100 er hovedadministrator. Verdier mellom 1 og 100 er ikke   brukt i dagens l&oslash;sning, men hvis man &oslash;nsker &aring; differensiere   administrator-tilgangen s&aring; er det tilrettelagt for det. </p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 54060 Jan   9 15:23 databaseHandler.php<br>  -rw-r--r-- 1 andrs staff 28 Aug 17 22:29 dbclose.php<br>  -rw-r--r-- 1 andrs staff 10 Aug 17 22:29 dbinit.php</font></p><p><font face="Courier New, Courier, mono">dbinit.php</font> skal initialisere   databaseforbindelsen og en handle eller peker til koblingen er tilgjenglig i   resten av systemet gjennom <font face="Courier New, Courier, mono">$dbh</font>.   Per idag ligger vel oppkoblingen mot databasen i auth.php men den skal flyttes.</p><p><font face="Courier New, Courier, mono">dbclose.php</font> lukker databasekoblingen.</p><p><font face="Courier New, Courier, mono">databaseHandler.php</font> inneholder   en funksjon for hver &quot;type&quot; av sp&oslash;rringer som gj&oslash;res   mot databasen. Dette er med hensikt samlet i samme filen, for &aring; f&aring;   det mer oversiktlig. Sp&oslash;rringene er laget med linjeskift og innrykk s&aring;   de skal v&aelig;re s&aring; lesevennlige som mulig.</p><p>Gjennomg&aring;ende har jeg benyttet n&oslash;stede sp&oslash;rringer der det   har v&aelig;rt naturlig for &aring; &oslash;ke hastigheten, og for &aring; gj&oslash;re   koden mer oversiktlig. Noen steder har dette f&oslash;rt til ganske komplekse   sp&oslash;rringer, men jeg har fors&oslash;kt &aring; gj&oslash;re det s&aring;   lesbart som mulig.</p><p>P&aring; de fleste listevisningene i webgrensesnittet har jeg fors&oslash;kt   &aring; f&aring; med s&aring; mye info som mulig, for &aring; gj&oslash;re administreringen   lettere. Slik at man for eksempel ser hvor mange brukere som er medlem i brukergrupper   ogs&aring; videre. Disse &quot;tellingene&quot; har ogs&aring; medf&oslash;rt   at sp&oslash;rringene har blitt litt komplekse.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 4745 Jan 9   10:30 fellesutstyr.php<br>  -rw-r--r-- 1 andrs staff 4856 Jan 9 09:40 utstyr.php<br>  -rw-r--r-- 1 andrs staff 5008 Nov 6 18:33 utstyrgrp.php </font></p><p>I <font face="Courier New, Courier, mono">utstyr.php</font> kan man opprette   og endre p&aring; utstyrsgrupper knyttet til sin private bruker. I<font face="Courier New, Courier, mono">   fellesutstyr.php</font> administrerer man utstyrsgrupper som er felles for administratorene   og som kan brukes som standardgrupper som knyttes til brukergrupper og vil v&aelig;re   tilgjengelig for alle brukere som er medlem av den gitte brukergruppen.</p><p>N&aring;r man skal endre p&aring; en bestemt utstyrgruppe er det i utstyrgrp.php   hvor man knytter utstyrsfiltre sammen og til utstyrsgruppe. Her endrer man prioritet   og rekkef&oslash;lge.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 4236 Nov 6   16:23 filter.php<br>  -rw-r--r-- 1 andrs staff 0000 --- - --:-- fellesfilter.php<br>  </font><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 7388   Nov 6 17:15 match.php </font></p><p>I <font face="Courier New, Courier, mono">filter.php</font> kan man opprette   og slette filtre til sin private bruker. Tilsvarende gjelder <font face="Courier New, Courier, mono">fellesfilter.php</font>   administreringen av filtre som er tilgjenglig bare for administratorer og brukes   til &aring; lage felles utstyrsgrupper som kan knyttes til brukergrupper.</p><p>I <font face="Courier New, Courier, mono">match.php</font> endrer man hvilke   betingelser eller matcher som m&aring; v&aelig;re oppfylte for at en hendelse   skal kunne validere som sann igjennom et definert utstyrfilter.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 464 Oct 2   10:21 hjelp.php</font></p><p>I menyen i venstremargen er det et menyvalg som heter hjelp, her er det meningen   at man skal finne all brukerdokumentasjon som skal v&aelig;re tilgjengelig for   brukeren. Dette kan v&aelig;re FAQ, ikonforklaringer og brukermanualer, og kanskje   systembeskrivelser. </p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 3582 Aug 17   22:29 image.php<br>  -rw-r--r-- 1 andrs staff 5608 Jan 8 12:30 profil.php<br>  -rw-r--r-- 1 andrs staff 10499 Nov 6 16:52 periode.php <br>  -rw-r--r-- 1 andrs staff 3452 Aug 17 22:29 timeplan.php </font></p><p>En bruker kan igjennom <font face="Courier New, Courier, mono">profil.php</font>   definere sine egne brukerprofiler og aktivisere en som skal v&aelig;re gjeldende.   Videre kan man i periode.php definere en timeplan for en gitt profil under <font face="Courier New, Courier, mono">periode.php</font>.   I denne visningen f&aring;r man en grafisk visning av en timeplan og dette bildet   blir generert i filen <font face="Courier New, Courier, mono">timeplan.php</font>.</p><p><font face="Courier New, Courier, mono">image.php</font> er tidligere versjon   av <font face="Courier New, Courier, mono">timeplan.php</font> og vil bli fjernet   fra cvs.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 677 Aug 17   22:29 kunnskap.php</font></p><p>Filen er ikke i bruk. Den er ment &aring; v&aelig;re en klasse for kobling   mot kunnskapsdatabasen for h&aring;ndtering av match-menyene. Dette er vel for&oslash;yeblikket   implementert rett inn i <font face="Courier New, Courier, mono">match.php</font>   for UNINETT sitt vedkommende.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 4269 Oct 30   13:50 listing.php</font></p><p>listing.php er et bibiliotek for &aring; lage en listevisning. den tar inn   overskrifter, alignment, og rader hver for seg og genererer en fin tabell html   tilbake. Denne er gjennomg&aring;ende brukt overalt, slik at hvis man &oslash;nsker   &aring; endre utseende eller m&aring;te tabellene er bygd opp p&aring;, kan   man enkelt gj&oslash;re det i dette biblioteket.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 176 Oct 23   14:10 loginordie.php</font></p><p>Seksjoner som krever innlogging (stort sett de fleste) kaller funksjonen <font face="Courier New, Courier, mono">loginordie()   </font>i denne filen, den sjekker om man er korrekt innlogget og skriver ut   en feilmelding hvis man ikke er det. Dette vil bare skje hvis noen fors&oslash;ker   &aring; omg&aring; innloggingsmekanismen for &aring; f&aring; tilgang til seksjoner   i webgrensesnittet.</p><p>Denne sjekker bare om man er innlogget eller ikke. En videref&oslash;ring som   er n&oslash;dvendig er &aring; gj&oslash;re en dobbeltsjekk mot brukerens administrasjonsniv&aring;   og sammenligne denne med niv&aring;et som seksjonen krever. Denne mekanisken   skal legges inn i <font face="Courier New, Courier, mono">index.php</font>,   der seksjonene kalles. N&aring;r det er gjort blir denne filen overfl&oslash;dig   og fjernet.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 3491 Jan 8   09:41 oversikt.php</font></p><p>N&aring;r man logger inn f&aring;r man en oversikt over alle brukergrupper   man er medlem i og hvilke ustyrsgrupper man har tilgang til som f&oslash;lge   av gruppemeldemskapene sine.Man kan ogs&aring; se aktiv profil og endre aktiv   profil i denne oversikten. Man f&aring;r ogs&aring; listet opp fullt navn p&aring;   brukeren som er innlogget.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 344 Oct 23   10:54 session.php</font></p><p>Bibliotek for h&aring;ndtering av sesjonsvariabler. Denne filen er ikke i bruk   i gjeldene versjon.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 3064 Jan 9   15:49 velgbrukergrupper.php</font></p><p>N&aring;r man oppretter en ny bruker eller endrer en bruker kan man krysse   av for alle brukergrupper denne brukeren skal meldes inn i.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 579 Sep 30   10:01 velkommen.php</font></p><p>Denne inneholder teksten som vises p&aring; fremsiden.</p><p><font face="Courier New, Courier, mono">-rw-r--r-- 1 andrs staff 1457 Oct 30   14:25 wap.php</font></p><p>Her kan man sl&aring; av &aring; p&aring; mulighet for wap-administrering av   sin bruker. Det blir generert en n&oslash;kkel som man bruker n&aring;r man   logger seg inn via wap. </p><h2><a name="database"></a>Databasedesign</h2><p>Databasen heter <font face="Courier New, Courier, mono">navuser</font>, og   befinner seg p&aring; samme maskin som NAV-installasjonen. Det ligger et initialiseringsskript   i cvs som sletter alle tabellene med innhold og oppretter de p&aring; nytt.<p>For &aring; f&aring; oversikt over databasen kan <a href="databasemodell.pdf">databasemodellen   (UML)</a> v&aelig;re til hjelp.<p>Databasen kan gjerne deles inn i 3 hoveddeler. Det er:<ol>  <li>Brukere </li>  <li>Utstyrgrupper</li>  <li>Brukerprofiler</li></ol><p>Utstyret blir gruppert med en slags matching mekanisme. Alt utstyr som matcher   et uttrykk er med i en gruppe. På den måten vil automatisk nytt ytstyr bli tilordnet   riktig gruppe uten noe manuell og tungvindt administrasjon. <p>Brukergruppene og brukerne kan tilordnes rettigheter til grupper av utstyr. <p>Og hver enkelt bruker kan s&aring; selv g&aring; inn &aring; opprette sine   egne profiler og grupper via webgrensesnittet.<h3><a name="brukere"></a>Brukere</h3><p>En bruker kan ha et vilkårlig antall alarmadresser. Alarmadressene tilordnes   typer. Disse typene kan f.eks være: 1 mail, 2 sms, 3 icq, 4 irc, 5 web, 6 sip(ip-telefoni).   Da kan adressen f.eks være tilsvarende: 1 bruker@uninett.no, 2 99664433, 3 23456567,   4 Nick!ident@server, 5 -, 6 sip:bruker@uninett.no. I utgangspunktet vil systemet   ha muligheten for Mail og SMS varsling, men denne måten å lagre adressene på   åpner for utvidelser i framtiden. Hvis en bruker &oslash;nsker &aring; sette   opp SMS alarmer m&aring; administrator gi brukeren rettighet til dette. <p>En bruker kan v&aelig;re medlem i vilk&aring;rlig mange grupper. Gruppene vil   angi hvilke rettigheter brukeren har til å sette opp alarmer. Samtidig vil den   gi et sett med standard utstyrsgrupper, som brukeren enkelt kan bruke i sine   profiler. Disse ferdiglagde brukergruppene kan brukes p&aring; tvers av organisasjoner   - og vil bli automatisk tilpasset, siden de vil bli satt sammen med den enkelte   bruker sine rettigheter. F.eks kan vi tenke oss en utstyrsgruppe som har navn   &quot;Webservere&quot;, denne er standard for alle brukere som er med i brukergruppen   &quot;WebUtviklere&quot;. La oss tenke oss to forskjellige webutviklere, en   som jobber for Uninett og en som jobber for ITEA. Webutvikleren som jobber for   ITEA er i tillegg til gruppen WebUtviklere medlem av gruppen ITEA-ansatt. N&aring;r   vedkommende &oslash;nsker &aring; lage seg en varslingsprofil som varsler n&aring;r   en webserver g&aring;r ned, krysser han for varlsing til &oslash;nskede adresser   koblet til utstyrsgruppen &quot;Webservere&quot;. Utstyrsgruppen Webservere   vil for vedkommende inneb&aelig;re alle webservere som vedkommende har tilgang   til og det vil kanskje bety alle webservere til ITEA.<p>Selv om brukergruppene i utgangspunktet ikke er definert hierarkisk, kan man   enkelt definere en hiearkisk struktur med brukergruppene. Man kan ha brukergrupper   som for eksempel, NTNU, Fakultet IME, Institutt Telematikk. En student kan da   v&aelig;re medlem av alle disse tre gruppene. En student p&aring; et annet fakutet   kan f.eks v&aelig;re medlem bare av NTNU-gruppen.<h3><a name="utstyr"></a>Utstyrgrupper</h3><p>Når man knytter varslingsprofiler til hvilket utstyr man skal overvåke, angir   man et sett med grupper av ustyr, og et sett med alarmtyper man &oslash;nsker   varsling p&aring;. Gruppene bestemmes i to nivåer. Utstyrsgrupper som er en   samling med Utstyrsfiltre. Et utstyrsfilter er en samling med parametre og verdier   som er en betingelse for at en enhet skal være medlem i en gruppe. <p>For eksempel kan man definere følgende filter:<br><tt>(stedsid = 34) AND (orgid = 54)</tt><br>  Dette filteret vil være realisert som et Utstyrsfilter, med to relaterte FilterMatch   rader. Disse radene vil ha matchtype lik eksakt, og matchfelt vil være henholdsvis   stedsid og orgid. <p>Merk at FilterMatch'ene danner et AND utrykk, som tilsammen bestemmer filteret.   I eksempelet over hadde vi utrykket <tt>(stedsid = 34) AND (orgid = 54)</tt>. <p>For &aring; danne en utstyrsgruppe kan man sette sammen en prioritert liste   med Utstyrsfiltre, hvor hver enkelt er merket med inkluder eller ekskluder.   P&aring; denne m&aring;ten kan man lage grupper som inneholder alle mulige kombinasjoner   av utstyr. Her er et eksempel p&aring; hvordan en gruppe kan bli bygget opp.<ol>  <li>Start med alle rutere som tilh&oslash;rer Uninett som er plassert i Trondheim</li>  <li> Ekskluder alle rutere som er i skygge</li>  <li>Ekskluder alle rutere som er under service</li>  <li>Ta allikvel med rutere som b&aring;de er i skygge og under service</li>  <li>Og ta allikvel med enheter som er i skygge og som har alvorlighetsgrad st&oslash;rre     enn 90%</li>  <li>Ekskluder alle feilmeldinger som har med h&oslash;y tempereatur &aring;     gj&oslash;re. (siden vaktmesteren f&aring;r de varslingene p&aring; SMS og     da umiddelbart skrur opp kj&oslash;leanlegget) </li></ol><p>Dette var bare et eksempel og sansynligvis et ganske d&aring;rlig et, men det   viser hvordan man kan bygge opp ganske spesielle filtre p&aring; en oversiktlig   og enkel m&aring;te.<h3><a name="profiler"></a>Brukerprofiler</h3><p>Brukerne kan definere sine egne profiler for varslinger. Eksempler på brukerprofiler   kan være:</p><ul>  <li>Ferie     <ul>      <li>bare viktige alarmer kommer</li>      <li>ingenting på epost alt på sms</li>    </ul>  </li>  <li>Vanlig     <ul>      <li>standard alarmvarsling</li>      <li>på epost i arbeidstida og sms på kveldstid</li>      <li>opplagring av alarmer om natta som blir sendt ut neste morgen på epost.</li>    </ul>  </li>  <li>Vaktsentral     <ul>      <li>både viktige alarmer og informasjonsmeldinger</li>      <li>ingenting på sms</li>      <li>alle alarmer på epost og irc</li>    </ul>  </li></ul><p>Brukerne har til enhver tid akkurat en brukerprofil aktiv. Brukerne kan sette   hvilken brukerprofil som er aktiv via webgrensesnittet.<p>En brukerprofil kan ha flere tidsperioder. Tabellen tidsperiode har feltet   helg, dette kan være f.eks: 0 alle dager, 1 man-fre, 2 lørdag og søndag.<p>Innenfor hver tidsperiode kan man for hver enkelt definert utstyrgrupper spesifisere   et antall alarmadresser, og om hver alarmadresse skal legges i kø eller sendes   med en gang. Den kan legges i forskjellige typer k&oslash;. Den kan legges i   d&oslash;gnlig k&oslash;. Den sendes ut et bestemt tidspunkt hver dag, dette   tidspunktet bestemmes for hver enkelt profil. Likeledes kan den legges i ukentlig   k&oslash;, brukeren kan ogs&aring; spesifisere dag og klokkeslett som den ukentlige   k&oslash;en t&oslash;mmes. Den kan ogs&aring; legges i en k&oslash; &quot;inntil   videre&quot;, da blir den liggende p&aring; vent, til brukeren bytter aktiv   profil en profil som kvalifiserer for utsendelse av den aktuelle alarmen. For   at alarmer ikke skal bli liggende i denne k&oslash;en for alltid, er det knyttet   en makstid til hver enkelt bruker som bestemmer hvor mange dager brukeren har   lov til &aring; ha alarmer liggende i k&oslash;en. N&aring;r en alarm har ligget   over denne fristen, blir alarmen sendt ut.<h2><a name="kontakt"></a>Kontaktperson</h2><p>Andreas &Aring;kre Solberg<br>  UNINETT AS<br>  <a href="mailto:Andreas.Solberg@uninett.no">Andreas.Solberg@uninett.no</a></body></html>