<html><head><title>NAV: Databasedesign dokumentasjon</title></head><body><h1>Dokumentasjon på NAV database for brukere og profiler</h1><p>Dokumentasjonen inneholder f&oslash;lgende elementer:<ul>  <li><a href="#this">Dette dokumentet</a> (beskrivelse av databasedesign)</li>  <li> <a href="navUML.pdf"><img src="pdf.gif" width="18" height="21" border="0">     UML diagram</a> abstrahert versjon av Profil/bruker-databasen</li>  <li><a href="navUMLtabell.pdf"><img src="pdf.gif" width="18" height="21" border="0">     UML diagram</a> med alle relasjonstabeller av Profil/bruker-databasen</li>  <li><a href="nav.sql">SQL-skript</a> for opprettelse av databasen</li>  <li><a href="http://pot.uninett.no/%7Eandrs/nav">Utviklingswebside</a> p&aring;     pot.uninett.no</li></ul><h1><a name="this"></a>Beskrivelse av nytt databasedesign for bruker og profilh&aring;ndtering   i NAV</h1><p>Denne databasen skal inneholde informasjon om alle brukerne i systemet. Brukerne   skal administreres i brukergrupper. En bruker kan være med i et vilkårlig antall   grupper. <p>Utstyret blir gruppert med en slags matching mekanisme. Alt utstyr som matcher   et uttrykk er med i en gruppe. På den måten vil automatisk nytt ytstyr bli tilordnet   riktig gruppe uten noe manuell og tungvindt administrasjon. Brukergruppene og   brukerne kan tilordnes rettigheter til grupper av utstyr. Og hver enkelt bruker   kan s&aring; selv g&aring; inn &aring; opprette sine egne profiler og grupper   via webgrensesnittet n&aring;r brukeren er interessert i &aring; f.eks. f&aring;   spesielt n&oslash;ye overv&aring;kning av sm&aring; deler av nettverket. Utstyrsgruppene   som blir opprettet av brukere vil automatisk v&aelig;re subsett av gruppene   brukeren har tilgang til.<h2>Brukere og alarmadresser</h2><p>En bruker kan ha et vilkårlig antall alarmadresser. Alarmadressene tilordnes   typer. Disse typene kan f.eks være: 1 mail, 2 sms, 3 icq, 4 irc, 5 web, 6 sip(ip-telefoni).   Da kan adressen f.eks være tilsvarende: 1 bruker@uninett.no, 2 99664433, 3 23456567,   4 Nick!ident@server, 5 -, 6 sip:bruker@uninett.no. I utgangspunktet vil systemet   ha muligheten for Mail og SMS varsling, men denne måten å lagre adressene på   åpner for utvidelser i framtiden. Hvis en bruker &oslash;nsker &aring; sette   opp SMS alarmer m&aring; administrator gi brukeren rettighet til dette.<h2>Brukere og grupper</h2><p>Man tildeler en ny bruker et sett av grupper. Gruppene vil angi hvilke rettigheter   brukeren har til å sette opp alarmer. Samtidig vil den gi et sett med standard   utstyrsgrupper, som brukeren enkelt kan bruke i sine profiler. Disse ferdiglagde   brukergruppene kan brukes p&aring; tvers av organisasjoner og vil bli tilpasset   siden de vil bli satt sammen med den enkelte bruker sine rettigheter. F.eks   kan vi tenke oss en utstyrsgruppe som har navn &quot;Webservere&quot;, denne   er standard for alle brukere som er med i brukergruppen &quot;WebUtviklere&quot;.   La oss tenke oss to forskjellige webutviklere, en som jobber for Uninett og   en som jobber for ITEA. Webutvikleren som jobber for ITEA er i tillegg til gruppen   WebUtviklere medlem av gruppen ITEA-ansatt. N&aring;r vedkommende &oslash;nsker   &aring; lage seg en varslingsprofil som varsler n&aring;r en webserver g&aring;r   ned, krysser han for varlsing til &oslash;nskede adresser koblet til utstyrsgruppen   &quot;Webservere&quot;. Utstyrsgruppen Webservere vil for vedkommende inneb&aelig;re   alle webservere som vedkommende har tilgang til og det vil kanskje bety alle   webservere til ITEA. <h2>Utstyrgrupper</h2><p>Når man knytter varslingsprofiler til hvilket utstyr man skal overvåke, angir   man et sett med grupper av ustyr, og et sett med alarmtyper man &oslash;nsker   varsling p&aring;. Gruppene bestemmes i to nivåer. Utstyrgrupper som er en samling   med Utstyrsfiltre. Et utstyrsfilter er en samling med parametre og verdier som   er en betingelse for at en enhet skal være medlem i en gruppe. <p>For eksempel kan man definere følgende gruppefilter:<br><tt>(stedsid = 34) AND (orgid = 54)</tt><br>  Dette filteret vil være realisert som et Utstyrsfilter, med to relaterte FilterMatch   rader. Disse radene vil ha matchtype lik eksakt, og matchfelt vil være henholdsvis   stedsid og orgid. <p>Merk at FilterMatch'ene danner et AND utrykk, som tilsammen bestemmer filteret.   I eksempelet over hadde vi utrykket <tt>(stedsid = 34) AND (orgid = 54)</tt>.   Det er ikke helt tilfeldig at m&aring;ten filterne er designet p&aring; lett   lar seg omforme til bolske utrykk som kan brukes i SQL ;o)<p>For &aring; danne en utstyrsgruppe kan man sette sammen en prioritert liste   med Utstyrsfiltre, hvor hver enkelt er merket med inkluder eller ekskluder.   P&aring; denne m&aring;ten kan man lage grupper som inneholder alle mulige kombinasjoner   av utstyr. Her er et eksempel p&aring; hvordan en gruppe kan bli bygget opp.<p>1: Start med alle rutere som tilh&oslash;rer Uninett som er plassert i trondheim<br>  2: Ekskluder alle rutere som er i skygge<br>  3: ekskluder alle rutere som er under service<br>  4: ta allikvel med rutere som b&aring;de er i skygge og under service<br>  5 og ta allikvel med enheter som er i skygge og som <br>  6 ekskluder alle feilmeldinger som har med h&oslash;y tempereatur &aring; gj&oslash;re.   (siden vaktmesteren f&aring;r de varslingene p&aring; SMS og da umiddelbart   skrur opp kj&oslash;leanlegget)<p>Dette var bare et eksempel og sansynligvis et ganske d&aring;rlig et men det   viser hvordan man kan bygge opp ganske spesielle filtre p&aring; en oversiktlig   og enkel m&aring;te. Noe av utfordringen blir &aring; lage grensesnittet for   opprettelse av utstyrsgrupper s&aring; enkelt at ingen brukere klarer &aring;   gj&oslash;re &quot;feil&quot;. Dette grensesnittet hvor brukerne jobber mot   blir webbasert og er noe jeg jobber med n&aring;.<p>Jeg har allerede algoritmen for &aring; konvertere denne type prioriterte lister   over til SQL.<h2>Brukerprofiler</h2><p>Brukerne kan definere sine egne profiler for alarm-varslinger. Eksempler på   brukerprofiler kan være:<br>- ferie ( bare viktige alarmer kommer, ingenting på epost alt på sms)<br>- vanlig ( standard alarmvarsling, på epost i arbeidstida og sms på kveldstid og opplagring av alarmer om natta som blir sendt ut neste morgen på epost.<br>- vaktsentral ( ingenting på sms, alle alarmer på epost og irc, både viktige og informasjon)<p>Brukerne har til enhver tid akkurat en brukerprofil aktiv. Brukerne kan sette hvilken brukerprofil som er aktiv via webgrensesnittet.<p>En brukerprofil kan ha flere tidsperioder. Tabellen tidsperiode har feltet   helg, dette kan være f.eks: 0 alle dager, 1 man-fre, 2 lørdag og søndag. <p>Innenfor hver tidsperiode kan man spesifisere et antall alarmadresser, og om hver alarmadresse skal legges i kø eller sendes med en gang.<p>Når alarmutsendeskriptet går inn i en ny tidsperiode, vil den sjekke om det ligger noen alarmer i kø og sende ut disse samlet. <h2>Diverse</h2><p>Skrevet av Andreas Åkre Solberg, 4. Juni 2002.<br>  Revidert 19. Juli 2002<br>  <a href="mailto:Andreas.Solberg@uninett.no">Andreas.Solberg@uninett.no</a> </body></html>